tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                      /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                       /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

//#define SEC_PARAM_TIMEOUT               30                                          /**< Timeout for Pairing Request or Security Request (in seconds). */
//#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
//#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
//#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
//#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
//#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size. */
//#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)                   /**< Maximum size of scheduler events. Timer is our largest scheduled event (8 bytes). Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler. */
#define SCHED_QUEUE_SIZE                10                                          /**< Maximum number of events in the scheduler queue. This is a best guess. */

/**@brief Structure of a DCC command. */
//typedef struct
//{
//    bool occupied;
//    bool sync;
//    bool feedback;
//    uint32_t data0;
//    uint32_t data1;
//    uint32_t data2;
//    uint8_t data0_count;
//    uint8_t data1_count;
//    uint8_t data2_count;
//} dcc_command_t;

/**@brief Structure of a scheduled DCC command. */
//typedef struct
//{
//    uint8_t byte1;
//    uint8_t byte2;
//    uint8_t byte3;
//    uint8_t byte4;
//    uint8_t byte5;
//    uint8_t len;
//    uint8_t feedback;
//} scheduled_dcc_command_t;

BLE_BLUETRACK_DEF(m_bluetrack);                                                 /**< Bluetrack Service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/


//static ble_gap_sec_params_t             m_sec_params;                               /**< Security requirements for this application. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};

// Persistent storage system event handler
//void pstorage_sys_event_handler (uint32_t p_evt);

//static ble_bluetrack_t                  m_bluetrack;                                          /**< BlueTrack service structure instance */
//static app_timer_id_t                   output_timer;                                         /**< App Timer instance for relay output timing */
//static app_timer_id_t                   feedback_timer;                                       /**< App Timer instance for feedback ADC measurement timing */
//static uint32_t                         output_index[N_OUTPUTS];                              /**< Pin Number storage for the relay outputs */
//static bool                             output_flags[N_OUTPUTS];                              /**< Flags for requesting relay activation */
//static dcc_command_t                    dcc_command_buffer[DCC_COMMAND_BUFFER_SIZE];          /**< DCC command buffer that stores pending commands */
//static uint8_t                          producer_index;                                       /**< Index of the next available DCC command buffer slot that can be filled */
//static uint8_t                          consumer_index;                                       /**< Index of the DCC command buffer slot currently being transmitted */
//static bool                             phase1_complete;                                      /**< Flag to control phases of DCC command */
//static bool                             phase2_complete;                                      /**< Flag to control phases of DCC command */
//static bool                             dcc_output_state;                                     /**< Flag to track whether we are currently outputting a DCC 1 or 0 */
//static bool                             dcc_disabled;                                         /**< Flag to indicate whether DCC has been disabled completely */
//static bool                             adc_baseline_flag;                                    /**< Flag to indicate to the ADC it should store its result as a baseline */
//static uint32_t                         adc_baseline;                                         /**< Baseline of current feedback measurement */
//static bool                             feedback_window_end;                                  /**< Flag to indicate that the feedback window should end */
//static bool                             feedback_in_progress;                                 /**< Flag to indicate whether we are monitoring for feedback */
//static bool                             acknowledge;                                          /**< Flag to indicate an acknowledge was received during feedback */
//static bool                             service_command_pending;                              /**< Flag to indicate whether a service command is pending */
//static bool                             service_command_in_progress;                          /**< Flag to indicate whether a service command is in progress */
//static uint8_t                          programming_track_mode;                               /**< Variable to keep track of programming track mode */
//static uint8_t                          programming_track_state;                              /**< Variable to keep track of programming track state */
//static uint8_t                          function;                                             /**< Function of the service command pending/in progress */
//static uint8_t                          mode;                                                 /**< Mode of the service command pending/in progress */
//static uint8_t                          CV_or_reg_upper;                                      /**< Upper portion of CV or register of the service command pending/in progress */
//static uint8_t                          CV_or_reg_lower;                                      /**< Lower portion of CV or register of the service command pending/in progress */
//static uint8_t                          value;                                                /**< Value to be written of the service command pending/in progress */
//static uint16_t                         read_byte_counter;                                    /**< Read byte counter of the service command pending/in progress */
//static uint8_t                          read_bit_counter;                                     /**< Read bit counter of the service command pending/in progress */
//static uint8_t                          read_bit_value;                                       /**< Read bit response of the service command pending/in progress */
//static dcc_command_t                    idle_packet;                                          /**< Memory reserved to transmit idle packets */
//static uint32_t                         active_speed_command_index;                           /**< Current place in the speed command array */
//static dcc_command_t                    speed_command_array_temp[SPEED_COMMAND_ARRAY_SIZE];   /**< Array for sending periodic speed commands */
//static dcc_command_t                    speed_command_array[SPEED_COMMAND_ARRAY_SIZE];        /**< Array for storing periodic speed commands */
//static uint8_t                          speed_command_address_type[SPEED_COMMAND_ARRAY_SIZE]; /**< Array for keeping track of the address type the corresponding periodic speed command applies to */
//static uint16_t                         speed_command_address[SPEED_COMMAND_ARRAY_SIZE];      /**< Array for keeping track of the address the corresponding periodic speed command applies to */


/**@brief Function for removing all periodic speed commands
 */
//static void remove_all_speed_commands (void)
//{
//    uint32_t i;
//    for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
//    {
//        speed_command_array[i].occupied = false;
//        speed_command_array_temp[i].occupied = false;
//        speed_command_address_type[i] = ADDRESS_TYPE_INVALID;
//    }
//}


/**@brief Function for disabling the DCC output.
 *
 * @details This function is called whenever the DCC output needs to be halted immediately (for example, in error condition). 
 * DCC output disabling is only resettable by complete system reset. 
 */
//static void disable_DCC (uint8_t error_code)
//{
//    uint32_t err_code;
//    
//    // Raise flag
//    dcc_disabled = true;
//
//    // Turn on brake
//    nrf_gpio_pin_clear(BRAKE_PIN_NO);
//
//    // Indicate on LED
//    nrf_gpio_pin_set(OVERLOAD_LED_PIN_NO);
//    
//    // Notify the client
//    err_code = ble_bluetrack_error_update(&m_bluetrack, error_code);
//    APP_ERROR_CHECK(err_code);
//}


