tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for notifying the programming track select characteristic.
 *
 * @details This function posts a notification to the programming track select characteristic. It is done outside the write handler as an error was observed previously in this context.
 *
 * @param[in]   p_event_data   Undefined pointer.
 * @param[in]   event_size     Size of 0.
 */
//void programming_track_select_notify (void *p_event_data, uint16_t event_size)
//{
//    uint32_t err_code;
//
//    if (event_size == 0)
//    {
//        err_code = ble_bluetrack_programming_track_select_update(&m_bluetrack);
//        APP_ERROR_CHECK(err_code);
//    }
//    else
//    {
//        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
//    }
//}


/**@brief Function for notifying the stop characteristic.
 *
 * @details This function posts a notification to the stop characteristic. It is done outside the write handler as an error was observed previously in this context
 *
 * @param[in]   p_event_data   Undefined pointer.
 * @param[in]   event_size     Size of 0.
 */
//void stop_notify (void *p_event_data, uint16_t event_size)
//{
//    uint32_t err_code;
//
//    if (event_size == 0)
//    {
//        err_code = ble_bluetrack_stop_update(&m_bluetrack);
//        APP_ERROR_CHECK(err_code);
//    }
//    else
//    {
//        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
//    }
//}


/**@brief Function for handling a write to the Programming Track Select characteristic.
 *
 * @details This function enters programming mode if select is true by enabling the programming track output and indicating via LED.
 *          We do not check for 250mA current sustained for 100ms, which is optional (should) in S-9.2.3.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   select         Flag to indicate whether the programming track should be selected.
 */
static void programming_track_select_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t select)
{
    NRF_LOG_INFO("Programming Track Select Written");

//    UNUSED_VARIABLE(p_bluetrack);
//    uint32_t err_code;
//    
//    if (select == MAIN)
//    {
//        programming_track_mode = MAIN;
//
//        // Indicate programming track deselection
//        nrf_gpio_pin_clear(PROGRAMMING_LED_PIN_NO);
//    }
//    else
//    {
//        programming_track_mode = PROGRAMMING;
//
//        // Indicate programming track selection
//        nrf_gpio_pin_set(PROGRAMMING_LED_PIN_NO);
//    }
//
//    // Notify the client
//    err_code = app_sched_event_put(NULL, 0, programming_track_select_notify);
//    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling a write to the Stop characteristic.
 *
 * @details This function halts DCC output if select is true by disabling the DCC pin, turning on the brake, and indicating via LED. It starts it again by reversing these conditions, 
 * only if the DCC output has not already been disabled.
 *
 * @param[in]   p_bluetrack    BlueTrack service structure.
 * @param[in]   select         Flag to indicate whether DCC output should be stopped.
 */
static void stop_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t stop)
{
    NRF_LOG_INFO("Stop Written");

//    UNUSED_VARIABLE(p_bluetrack);
//    uint32_t err_code;
//
//    // First clear all periodic speed commands
//    remove_all_speed_commands();
//    
//    if (stop)
//    {
//        // Turn on brake
//        nrf_gpio_pin_clear(BRAKE_PIN_NO);
//
//        // Indicate on LED
//        nrf_gpio_pin_set(STOP_LED_PIN_NO);
//    }
//    else if (!stop)
//    {
//        // Indicate on LED
//        nrf_gpio_pin_clear(STOP_LED_PIN_NO);
//
//        // Only start DCC output if disabled flag is not set
//        if (!dcc_disabled)
//        {
//            // Release the brake
//            nrf_gpio_pin_set(BRAKE_PIN_NO);
//        }
//    }
//
//    // Notify the client
//    err_code = app_sched_event_put(NULL, 0, stop_notify);
//    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling a write to the Service Command characteristic.
 *
 * @details This function sets up global variables to precipitate a series of service command sequences.
 *
 * @param[in]   p_bluetrack            BlueTrack service structure.
 * @param[in]   function_local         Indicates whether this is a read_bit, read_byte, write_bit, or write_byte series.
 * @param[in]   mode_local             Indicates whether the access mode is direct, paged, register, or address.
 * @param[in]   CV_or_reg_upper_local  The upper portion of the CV or register address to be accessed.
 * @param[in]   CV_or_reg_lower_local  The lower portion of the CV or register address to be accessed.
 * @param[in]   value_local            The value to be written to the CV or register address if write_byte series.
 */
static void service_command_write_handler(ble_bluetrack_t * p_bluetrack, uint8_t function_local, uint8_t mode_local, uint8_t CV_or_reg_upper_local, uint8_t CV_or_reg_lower_local, uint8_t value_local)
{
    NRF_LOG_INFO("Service Command Written");

//    UNUSED_VARIABLE(p_bluetrack);
//    if (!service_command_pending && !service_command_in_progress)
//    {
//        // Initialise counters and values
//        read_byte_counter = 0;
//        read_bit_counter = 0;
//        read_bit_value = 0;
//        
//        // Store command parameters
//        function = function_local;
//        mode = mode_local;
//        CV_or_reg_upper = CV_or_reg_upper_local;
//        CV_or_reg_lower = CV_or_reg_lower_local;
//        value = value_local;
//        
//        // Raise pending flag only if parameters are valid
//        if ((function == FUNCTION_READ_BIT || function == FUNCTION_READ_BYTE || function == FUNCTION_WRITE_BIT || function == FUNCTION_WRITE_BYTE) &&
//            (mode == MODE_DIRECT || mode == MODE_ADDRESS || mode == MODE_PAGED || mode == MODE_REGISTER) &&
//            ((function != FUNCTION_READ_BIT && function != FUNCTION_WRITE_BIT) || ((function == FUNCTION_READ_BIT || function == FUNCTION_WRITE_BIT) && (mode == MODE_DIRECT))))
//        {
//            service_command_pending = true;
//        }
//    }
}


/**@brief Function for executing a service command.
 *
 * @details This function places a series of DCC commands in the buffer corresponding to the service command requested, as
 * indicated by the relevant global variables. Every service command sequence must have a feedback request.
 *
 * @param[in]   p_event_data   Undefined pointer.
 * @param[in]   event_size     Size of 0.
 */
//void execute_service_command (void *p_event_data, uint16_t event_size)
//{
//    uint8_t byte1;
//    uint8_t byte2;
//    uint8_t byte3;
//
//    uint8_t i;
//
//    uint8_t page;
//    uint8_t data_register;
//    
//    uint16_t CV_or_reg = ( ((uint16_t)CV_or_reg_lower) | 
//                 ( ((uint16_t)CV_or_reg_upper) << 8 ) );
//#ifdef DEBUG
//    uint32_t err_code;
//#endif
//    if (event_size == 0)
//    {
//        // As per S-9.2.3, we should guarantee a power on cycle by queueing 20 idle packets
//        for (i = 0; i < 20; i++)
//        {
//            enqueue_dcc_command(0xFF, 0, 0, 0, 0, 2, 0, NULL);
//        }
//        
//        if (function == FUNCTION_WRITE_BYTE)
//        {
//            if (mode == MODE_DIRECT)
//            {
//                // TOTAL 14
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // We are sending a CV address, so only extract the lower two bits from the upper byte
//                byte1 = 0x7C | (CV_or_reg_upper & 0x03);
//                byte2 = CV_or_reg_lower;
//                byte3 = value;
//                
//                // 5 write packets
//                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//            else if (mode == MODE_ADDRESS)
//            {
//                // TOTAL 32
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                byte1 = 0x78;
//                // Ensure the address to be written is <= 127 (S-9.2.2 CV 1)
//                byte2 = value & 0x7F;
//                
//                // 5 write packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 10 reset packets
//                for (i = 0; i < 10; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//            else if (mode == MODE_REGISTER)
//            {
//                // TOTAL 32
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // For a register address, extract only the lower three bits from the lower byte
//                byte1 = 0x78 | (CV_or_reg_lower & 0x07);
//                byte2 = value;
//                
//                // 5 write packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 10 reset packets
//                for (i = 0; i < 10; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//            else if (mode == MODE_PAGED)
//            {
//                // TOTAL 28
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // Ensure CV is < 1024 before converting to page number
//                page = ((CV_or_reg & 0x03FF) / 4) + 1;
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, page, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // Ensure CV is < 1024 before converting to register number
//                data_register = (CV_or_reg & 0x03FF) % 4;
//                byte1 = 0x78 | data_register;
//                byte2 = value;
//                
//                // 5 write packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//        }
//        else if (function == FUNCTION_READ_BYTE)
//        {
//            if (mode == MODE_DIRECT)
//            {
//                // TOTAL 9
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // We are sending a CV address, so only extract the lower two bits from the upper byte
//                byte1 = 0x74 | (CV_or_reg_upper & 0x03);
//                byte2 = CV_or_reg_lower;
//                byte3 = read_byte_counter;
//                
//                // 5 read packets
//                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
//                }
//                
//                // 1 reset packet
//                enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//            }
//            else if (mode == MODE_ADDRESS)
//            {
//                // TOTAL 21
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 5 reset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                byte1 = 0x70;
//                // Ensure the address to be written is <= 127
//                byte2 = read_byte_counter & 0x7F;
//                
//                // 5 read packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//            else if (mode == MODE_REGISTER)
//            {
//                // TOTAL 24
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, 0x01, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // For a register address, extract only the lower three bits from the lower byte
//                byte1 = 0x70 | (CV_or_reg_lower & 0x07);
//                byte2 = read_byte_counter;
//                
//                // 7 read packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 7; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//            else if (mode == MODE_PAGED)
//            {
//                // TOTAL 22
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // Ensure CV is < 1024 before converting to page number
//                page = ((CV_or_reg & 0x03FF) / 4) + 1;
//                
//                // 5 page preset packets
//                for (i = 0; i < 5; i++)
//                {
//                    enqueue_dcc_command(0x7D, page, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // Ensure CV is < 1024 before converting to register number
//                data_register = (CV_or_reg & 0x03FF) % 4;
//                byte1 = 0x70 | data_register;
//                byte2 = value;
//                
//                // 5 read packets
//                enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//        }
//        else if (function == FUNCTION_WRITE_BIT)
//        {
//            if (mode == MODE_DIRECT)
//            {
//                // TOTAL 14
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // We are sending a CV address, so only extract the lower two bits from the upper byte
//                byte1 = 0x78 | (CV_or_reg_upper & 0x03);
//                byte2 = CV_or_reg_lower;
//                // The lower 4 bits of value are the bit value to be written (bit 3) and the bit position (bits 2-0)
//                byte3 = 0xF0 | (value & 0x0F);
//                
//                // 5 write packets
//                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
//                }
//                
//                // 6 reset packets
//                for (i = 0; i < 6; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//            }
//        }
//        else if (function == FUNCTION_READ_BIT)
//        {
//            if (mode == MODE_DIRECT)
//            {
//                // TOTAL 9
//                // 3 reset packets
//                for (i = 0; i < 3; i++)
//                {
//                    enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//                }
//                
//                // We are sending a CV address, so only extract the lower two bits from the upper byte
//                byte1 = 0x78 | (CV_or_reg_upper & 0x03);
//                byte2 = CV_or_reg_lower;
//                // read_bit_counter is the bit position
//                byte3 = 0xE8 | (read_bit_counter & 0x07);
//                
//                // 5 read packets
//                enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 1, NULL);
//                for (i = 0; i < 4; i++)
//                {
//                    enqueue_dcc_command(byte1, byte2, byte3, 0, 0, 3, 0, NULL);
//                }
//                
//                // 1 reset packet
//                enqueue_dcc_command(0, 0, 0, 0, 0, 2, 0, NULL);
//            }
//        }
//#ifdef DEBUG
//        err_code = app_uart_put_string("Service command enqueued\n\r");
//        APP_ERROR_CHECK(err_code);
//#endif
//    }
//    else
//    {
//        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
//    }
//}


/**@brief Function for handling the GPIOTE interrupt.
 *
 * @details The GPIOTE interrupt handler will only be called on thermal pin going LOW, indicating overtemperature, therefore disable DCC.
 */
//void GPIOTE_IRQHandler(void)
//{
//    // Clear event
//    NRF_GPIOTE->EVENTS_IN[0] = 0;
//
//    // Disable DCC
//    disable_DCC(ERROR_CODE_OVERTEMPERATURE);
//}


