tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for handling the LPCOMP interrupt.
 *
 * @details The LPCOMP interrupt handler will only be called on a READY or UP event from the comparator. In both these cases, check the result of the comparison.
 * For the READY case, this checks if the comparator is already HIGH on activation. For the UP case, this provides a "debounce" of sorts. If the result is HIGH, 
 * disable DCC, as we are in an overcurrent condition. 
 */
//void LPCOMP_IRQHandler(void)
//{
//    // Clear events
//    NRF_LPCOMP->EVENTS_READY = 0;
//    NRF_LPCOMP->EVENTS_UP = 0;
//
//    // We are either ready, or we observed a up crossing; obtain sample
//    NRF_LPCOMP->TASKS_SAMPLE = 1;
//    if (NRF_LPCOMP->RESULT)
//    {
//        // Disable DCC
//        disable_DCC(ERROR_CODE_OVERCURRENT);
//    }
//}


/**@brief Function for handling the ADC interrupt.
 *
 * @details The ADC interrupt handler will only be called on an END event. In this case, the result is read. Depending on the state of the application flags, 
 * this result is either stored as the baseline of a feedback collection, or compared to the baseline to determine whether the acknowledge flag should be raised.
 */
//void ADC_IRQHandler(void)
//{
//    // Clear event
//    NRF_ADC->EVENTS_END = 0;
//
//    // Record or compare to baseline
//    if (adc_baseline_flag)
//    {
//        adc_baseline = NRF_ADC->RESULT;
//        adc_baseline_flag = false;
//    }
//    else
//    {
//        // Set acknowledge if the result was the required amount above the baseline
//        if (NRF_ADC->RESULT > (adc_baseline + ADC_DELTA))
//        {
//            acknowledge = true;
//        }
//    }
//}


/**@brief Function for handling the TIMER1 interrupt.
 *
 * @details This interrupt drives the DCC output logic. Based on the phase flags, and the state of the buffer, appropriate values are loaded into TIMER1 CC[0]
 * register correponding to durations of DCC 1s and 0s. A sync output is triggered at the start of each packet. If required, feedback is collected.
 */
//void TIMER1_IRQHandler(void)
//{
//    uint32_t err_code;
//    dcc_command_t *active_packet = NULL;
//    bool dcc_packet = false;
//    uint32_t i;
//
//    // Clear events
//    NRF_TIMER1->EVENTS_COMPARE[0] = 0;
//
//    if (phase1_complete)
//    {
//        // We have ended phase 1, timer value remains the same for phase 2
//        phase1_complete = false;
//        phase2_complete = true;
//    }
//    else if (phase2_complete)
//    {
//        // We have ended phase 2, timer value update may be required
//        // First check if there is a pending packet (idle, repeat command, or from the buffer); a packet from the buffer takes priority
//        if (dcc_command_buffer[consumer_index].occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == MAIN_REPEAT)))
//        {
//            active_packet = &dcc_command_buffer[consumer_index];
//            dcc_packet = true;
//        }
//        else if (speed_command_array_temp[active_speed_command_index].occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == PROGRAMMING)))
//        {
//            active_packet = &speed_command_array_temp[active_speed_command_index];
//        }
//        else if (idle_packet.occupied && !((programming_track_mode == PROGRAMMING) && (programming_track_state == MAIN_REPEAT)))
//        {
//            active_packet = &idle_packet;
//        }
//        
//        if (active_packet)
//        {
//            // Clear the sync output
//            nrf_gpio_pin_clear(SYNC_PIN_NO);
//            // Enable sync output if this is the first bit of this packet
//            if (active_packet->sync)
//            {
//                nrf_gpio_pin_set(SYNC_PIN_NO);
//                active_packet->sync = false;
//            }
//
//            // Only start feedback if feedback is not in progress
//            if (active_packet->feedback && !feedback_in_progress)
//            {
//                // Set variables
//                feedback_in_progress = true;
//                adc_baseline_flag = true;
//                feedback_window_end = false;
//                acknowledge = false;
//                // Start ADC
//                NRF_ADC->TASKS_START = 1;
//                // Start timer
//                err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL, APP_TIMER_PRESCALER), NULL);
//                APP_ERROR_CHECK(err_code);
//            }
//            // Clear feedback flag, we do not want to check it again for this packet
//            active_packet->feedback = false;
//
//            // Determine data for transmission
//            if (active_packet->data0_count > 0)
//            {
//                dcc_output_state = BIT_31 & active_packet->data0;
//                active_packet->data0 = (active_packet->data0 << 1);
//                active_packet->data0_count = active_packet->data0_count - 1;
//            }
//            else if (active_packet->data1_count > 0)
//            {
//                dcc_output_state = BIT_31 & active_packet->data1;
//                active_packet->data1 = (active_packet->data1 << 1);
//                active_packet->data1_count = active_packet->data1_count - 1;
//            }
//            else if (active_packet->data2_count > 0)
//            {
//                dcc_output_state = BIT_31 & active_packet->data2;
//                active_packet->data2 = (active_packet->data2 << 1);
//                active_packet->data2_count = active_packet->data2_count - 1;
//            }
//            else
//            {
//                APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
//            }
//            // Send data
//            phase1_complete = true;
//            phase2_complete = false;
//            NRF_TIMER1->CC[0] = dcc_output_state ? DCC_ONE_CC_VAL : DCC_ZERO_CC_VAL;
//
//            // Check for exhaustion and unset occupied
//            if (active_packet->data2_count == 0)
//            {
//                active_packet->occupied = false;
//                
//                if (dcc_packet)
//                {
//                    // If it was a DCC packet, update global variables
//                    consumer_index = consumer_index + 1;
//                    // Reset consumer index if we have overflowed
//                    if (consumer_index == DCC_COMMAND_BUFFER_SIZE)
//                    {
//                        consumer_index = 0;
//                    }
//                    
//                    // If we were in a service command and the buffer is empty, indicate to the feedback timer that the buffer is empty and the service command is complete.
//                    // This ensures we continue to look for basic acknowledgement pulses through the decoder recovery time (S-9.2.3)
//                    // NOTE: This ASSUMES all service commands include a feedback command at some point, as the feedback timer is the only thing that can turn service_command_in_progress off
//                    // ASSUME idle packets and speed command packets never request feedback
//                    if (!dcc_command_buffer[consumer_index].occupied && service_command_in_progress)
//                    {
//                        feedback_window_end = true;
//                    }
//                }
//            }
//        }
//        else
//        {
//            // There is nothing to send in any of the packet sources
//            // We're guaranteed to have an empty buffer, so execute a service command, if one is pending
//            if (service_command_pending) {
//                service_command_in_progress = true;
//                service_command_pending = false;
//                err_code = app_sched_event_put(NULL, 0, execute_service_command);
//                APP_ERROR_CHECK(err_code);
//#ifdef DEBUG
//                err_code = app_uart_put_string("Execute service command\n\r");
//                APP_ERROR_CHECK(err_code);
//#endif
//            }
//            
//            // There was no valid speed command packet at the current index (or we were inhibited from sending it), so update the temporary array for that index, increment (to avoid fixating on a single valid entry) and identify the next valid one
//
//            // Copy the speed command back over, making sure to set occupied last (a process removing a speed command will set occupied false first)
//            speed_command_array_temp[active_speed_command_index].data0 = speed_command_array[active_speed_command_index].data0;
//            speed_command_array_temp[active_speed_command_index].data0_count = speed_command_array[active_speed_command_index].data0_count;
//            speed_command_array_temp[active_speed_command_index].data1 = speed_command_array[active_speed_command_index].data1;
//            speed_command_array_temp[active_speed_command_index].data1_count = speed_command_array[active_speed_command_index].data1_count;
//            speed_command_array_temp[active_speed_command_index].data2 = speed_command_array[active_speed_command_index].data2;
//            speed_command_array_temp[active_speed_command_index].data2_count = speed_command_array[active_speed_command_index].data2_count;
//            
//            speed_command_array_temp[active_speed_command_index].sync = speed_command_array[active_speed_command_index].sync;
//            speed_command_array_temp[active_speed_command_index].feedback = speed_command_array[active_speed_command_index].feedback;
//            speed_command_array_temp[active_speed_command_index].occupied = speed_command_array[active_speed_command_index].occupied;
//            
//            // Increment the active speed command index so we don't repeat the command over and over
//            active_speed_command_index = active_speed_command_index + 1;
//            // Reset active speed command index if we have overflowed
//            if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
//            {
//                active_speed_command_index = 0;
//            }
//            
//            // Now go through the array once to find the next valid packet
//            for (i = 0; i < SPEED_COMMAND_ARRAY_SIZE; i++)
//            {
//                if (speed_command_array_temp[active_speed_command_index].occupied)
//                {
//                    // We've found a valid packet
//                    break;
//                }
//                else
//                {
//                    active_speed_command_index = active_speed_command_index + 1;
//                    // Reset active speed command index if we have overflowed
//                    if (active_speed_command_index == SPEED_COMMAND_ARRAY_SIZE)
//                    {
//                        active_speed_command_index = 0;
//                    }
//                }
//            }
//            
//            // The idle packet needs refreshing (or we were inhibited from sending it)
//            idle_packet.data0 = 0xFFFFF000 | (0xFF << 3);
//            idle_packet.data0_count = 30;
//            idle_packet.data1 = 0x00004000 | (0x00 << 24) | ((0xFF ^ 0x00) << 15);
//            idle_packet.data1_count = 18;
//            idle_packet.data2 = 0x80000000;
//            idle_packet.data2_count = 1;
//            
//            idle_packet.sync = false;
//            idle_packet.feedback = false;
//            idle_packet.occupied = true;
//            
//            // Now update the programming state
//            if ((programming_track_mode == MAIN) && (programming_track_state != MAIN))
//            {
//                // Disable OUT[2] and OUT[3] GPIOTE
//                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                
//                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                
//                // Set DCC output to OUT[2] (controlled by TIMER1) and DCC programming output to OUT[3] (continuous 1s)
//                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                
//                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                
//                // Enable OUT[2] and OUT[3] GPIOTE
//                NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//                
//                NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//
//                programming_track_state = MAIN;
//            }
//            else if (programming_track_mode == PROGRAMMING)
//            {
//                if (programming_track_state == PROGRAMMING)
//                {
//                    // Disable OUT[2] and OUT[3] GPIOTE
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    // Set DCC output to OUT[2] (controlled by TIMER1) and DCC programming output to OUT[3] (continuous 1s)
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                    
//                    // Enable OUT[2] and OUT[3] GPIOTE
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//
//                    programming_track_state = MAIN_REPEAT;
//                }
//                else
//                {
//                    // Disable OUT[2] and OUT[3] GPIOTE
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    // Set DCC programming output to OUT[2] (controlled by TIMER1) and DCC output to OUT[3] (continuous 1s)
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_PSEL_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos;
//                    
//                    // Enable OUT[2] and OUT[3] GPIOTE
//                    NRF_GPIOTE->CONFIG[2] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[2] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//                    
//                    NRF_GPIOTE->CONFIG[3] &= ~GPIOTE_CONFIG_MODE_Msk;
//                    NRF_GPIOTE->CONFIG[3] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//
//                    programming_track_state = PROGRAMMING;
//                }
//            }
//
//            // Send a single one, as we have no data to send this time
//            dcc_output_state = true;
//            phase1_complete = true;
//            phase2_complete = false;
//            NRF_TIMER1->CC[0] = DCC_ONE_CC_VAL;
//        }
//    }
//    else
//    {
//        APP_ERROR_CHECK(NRF_ERROR_INVALID_FLAGS);
//    }
//}


