tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
/**@brief Function for handling the feedback application timer expiry.
 *
 * @details Feedback application timer runs continuously every feedback window until the DCC buffer is empty. Every time it completes, it triggers
 * another ADC sample, or terminates the feedback window and, if required, the service command.
 */
//static void feedback_timer_timeout_handler(void *p_context)
//{
//    uint32_t err_code;
//
//    UNUSED_VARIABLE(p_context);
//
//    // Check the counter; if expired, feedback window has finished
//    if (!feedback_window_end)
//    {
//        // Trigger ADC sample
//        NRF_ADC->TASKS_START = 1;
//        err_code = app_timer_start(feedback_timer, APP_TIMER_TICKS(ADC_SAMPLE_INTERVAL, APP_TIMER_PRESCALER), NULL);
//        APP_ERROR_CHECK(err_code);
//    }
//    else
//    {
//        // Buffer is empty in service mode
//        if (function == FUNCTION_WRITE_BYTE || function == FUNCTION_WRITE_BIT)
//        {
//            // We are done now, transmit back result
//            err_code = ble_bluetrack_response_update(&m_bluetrack, acknowledge ? 0x01 : 0x00, value);
//            if (err_code != NRF_SUCCESS &&
//                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//                err_code != NRF_ERROR_INVALID_STATE)
//            {
//                APP_ERROR_CHECK(err_code);
//            }
//            service_command_in_progress = false;
//        }
//        else if (function == FUNCTION_READ_BYTE)
//        {
//            // Last condition is special case to avoid repeating the read byte values for an address mode read
//            if (acknowledge || (read_byte_counter >= READ_BYTE_COUNTER_MAX) || (mode == MODE_ADDRESS && read_byte_counter >= READ_BIT_COUNTER_MAX_ADDRESS))
//            {
//                // We have either received a positive response, or we've exhausted all values, transmit back result
//                err_code = ble_bluetrack_response_update(&m_bluetrack, acknowledge ? 0x01 : 0x00, read_byte_counter);
//                if (err_code != NRF_SUCCESS &&
//                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//                    err_code != NRF_ERROR_INVALID_STATE)
//                {
//                    APP_ERROR_CHECK(err_code);
//                }
//                service_command_in_progress = false;
//            }
//            else
//            {
//                // No response received, continue to try new values
//                read_byte_counter = read_byte_counter + 1;
//                err_code = app_sched_event_put(NULL, 0, execute_service_command);
//                APP_ERROR_CHECK(err_code);
//            }
//        }
//        else if (function == FUNCTION_READ_BIT)
//        {
//            read_bit_value = read_bit_value | ((acknowledge ? 1 : 0) << read_bit_counter);
//            if (read_bit_counter >= READ_BIT_COUNTER_MAX)
//            {
//                // We have finished asking for the value of all bit positions, transmit back result
//                err_code = ble_bluetrack_response_update(&m_bluetrack, 0x01, read_bit_value);
//                if (err_code != NRF_SUCCESS &&
//                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
//                    err_code != NRF_ERROR_INVALID_STATE)
//                {
//                    APP_ERROR_CHECK(err_code);
//                }
//                service_command_in_progress = false;
//            }
//            else
//            {
//                // Ask for next bit position
//                read_bit_counter = read_bit_counter + 1;
//                err_code = app_sched_event_put(NULL, 0, execute_service_command);
//                APP_ERROR_CHECK(err_code);
//            }
//        }
//        
//        // Lower feedback flag
//        feedback_in_progress = false;
//    }
//}


/**@brief Function for handling the output application timer expiry.
 *
 * @details Output application timer runs continuously. Every time it completes, it checks if it needs to actuate a relay output by looking at the flags. It passes the value of
 * the relay output to itself so it can clear it on expiry. Flags are searched independent of raise order. Only one relay is ever actuated at a time to protect the power supply.
 */
//static void output_timer_timeout_handler(void *p_context)
//{
//    uint32_t * index = (uint32_t*)p_context;
//    uint32_t i, err_code;
//    bool enqueued_output = false;
//
//    // Turn off output if one was actuated
//    if (index != NULL)
//    {
//        nrf_gpio_pin_clear(*index);
//    }
//
//    // Look for an enqueued output and start timer if we find one
//    for (i = 0; i < (N_OUTPUTS); i++)
//    {
//        if (output_flags[i])
//        {
//            enqueued_output = true;
//
//            // Lower flag
//            output_flags[i] = false;
//
//            // Turn on output
//            nrf_gpio_pin_set(output_index[i]);
//
//            // Start timer.
//            err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), &(output_index[i]));
//            APP_ERROR_CHECK(err_code);
//
//            // Only one relay is to be actuated at at time to protect the power supply.
//            break;
//        }
//    }
//
//    if (!enqueued_output)
//    {
//        // Start timer with no output actuation
//        err_code = app_timer_start(output_timer, APP_TIMER_TICKS(ACTUATION_INTERVAL, APP_TIMER_PRESCALER), NULL);
//        APP_ERROR_CHECK(err_code);
//    }
//#ifdef DEBUG
//    err_code = app_uart_put_string("Output timer fired\n\r");
//    APP_ERROR_CHECK(err_code);
//#endif
//}


/**@brief Function for initializing the GIO module.
 */
//static void gio_init(void)
//{
//    uint32_t i;
//
//    // Initialise overload LED
//    nrf_gpio_cfg_output(OVERLOAD_LED_PIN_NO);
//    nrf_gpio_pin_clear(OVERLOAD_LED_PIN_NO);
//
//    // Initialise programming LED
//    nrf_gpio_cfg_output(PROGRAMMING_LED_PIN_NO);
//    nrf_gpio_pin_clear(PROGRAMMING_LED_PIN_NO);
//
//    // Initialise stop LED (we start off stopped)
//    nrf_gpio_cfg_output(STOP_LED_PIN_NO);
//    nrf_gpio_pin_set(STOP_LED_PIN_NO);
//
//    // Initialise sync output
//    nrf_gpio_cfg_output(SYNC_PIN_NO);
//    nrf_gpio_pin_clear(SYNC_PIN_NO);
//
//    // Initialise brake output (LOW is engaged, we start off engaged)
//    nrf_gpio_cfg_output(BRAKE_PIN_NO);
//    nrf_gpio_pin_clear(BRAKE_PIN_NO);
//
//    // Initialise relay outputs
//    for (i =0; i < (N_OUTPUTS); i++)
//    {
//        nrf_gpio_cfg_output(i+OUTPUT_OFFSET);
//        nrf_gpio_pin_clear(i+OUTPUT_OFFSET);
//    }
//}


/**@brief Function for initialising the GPIOTE module.
 */
//static void gpiote_init(void)
//{
//    // Initialise DCC output - under GPIOTE control
//    nrf_gpio_cfg_output(DCC_COMMAND_PIN_NO);
//    
//    // Initialise programming DCC output - under GPIOTE control
//    nrf_gpio_cfg_output(DCC_COMMAND_PROG_PIN_NO);
//
//    // Initialise BLE LED - under GPIOTE control initially
//    nrf_gpio_cfg_output(BLE_LED_PIN_NO);
//
//    // Initialise thermal input - under GPIOTE control
//    nrf_gpio_cfg_sense_input(THERMAL_PIN_NO, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_HIGH);
//
//    // Thermal input on IN[0]
//    NRF_GPIOTE->CONFIG[0] = (
//                            (GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos) |
//                            (THERMAL_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
//                            (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos)
//                            );
//
//    // Advertising output on OUT[1]
//    NRF_GPIOTE->CONFIG[1] = (
//                            (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
//                            (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
//                            (BLE_LED_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
//                            (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
//                            );
//
//    // DCC output on OUT[2] (initially)
//    NRF_GPIOTE->CONFIG[2] = (
//                            (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
//                            (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
//                            (DCC_COMMAND_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
//                            (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
//                            );
//    
//    // DCC programming output on OUT[3] (initially)
//    NRF_GPIOTE->CONFIG[3] = (
//                             (GPIOTE_CONFIG_OUTINIT_Low << GPIOTE_CONFIG_OUTINIT_Pos) |
//                             (GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos) |
//                             (DCC_COMMAND_PROG_PIN_NO << GPIOTE_CONFIG_PSEL_Pos) |
//                             (GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos)
//                             );
//
//    // Configure IN[0] interrupt
//    NRF_GPIOTE->INTENSET = GPIOTE_INTENSET_IN0_Msk;
//    NVIC_ClearPendingIRQ(GPIOTE_IRQn);
//    NVIC_SetPriority(GPIOTE_IRQn, GPIOTE_IRQ_PRI);
//    NVIC_EnableIRQ(GPIOTE_IRQn);
//
//    // Check if IN[0] was already low, if so, disable DCC
//    if (!nrf_gpio_pin_read(THERMAL_PIN_NO))
//    {
//        disable_DCC(ERROR_CODE_OVERTEMPERATURE);
//    }
//}


/**@brief Function for initialising timers.
 *
 * @details Initializes the application timer, as well as TIMER1 and TIMER2.
 */
static void timers_init(void)
{
//    uint32_t err_code;
//
//    // Initialise TIMER1
//    NRF_TIMER1->PRESCALER = TIMER1_PRESCALER_VAL;
//    // Short timer completion to clear
//    NRF_TIMER1->SHORTS = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
//    // Set initial timeout corresponding to a DCC one
//    NRF_TIMER1->CC[0] = DCC_ONE_CC_VAL;
//    NRF_TIMER1->INTENSET = TIMER_INTENSET_COMPARE0_Msk;
//    // Register TIMER1 interrupt with softdevice
//    NVIC_SetPriority(TIMER1_IRQn, TIMER1_IRQ_PRI);
//    NVIC_ClearPendingIRQ(TIMER1_IRQn);
//    NVIC_EnableIRQ(TIMER1_IRQn);
//
//    // Initialise TIMER2 to LED flash timing
//    NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_LED;
//    // Short timer completion to clear
//    NRF_TIMER2->SHORTS = TIMER_SHORTS_COMPARE0_CLEAR_Msk;
//    NRF_TIMER2->CC[0] = TIMER2_CC_VAL_LED;
//
//    // Initialise application timer, with the scheduler.
//    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);
//    // Create output application timer
//    err_code = app_timer_create(&output_timer, APP_TIMER_MODE_SINGLE_SHOT, output_timer_timeout_handler);
//    APP_ERROR_CHECK(err_code);
//    // Create feedback application timer
//    err_code = app_timer_create(&feedback_timer, APP_TIMER_MODE_SINGLE_SHOT, feedback_timer_timeout_handler);
//    APP_ERROR_CHECK(err_code);

    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initialising the Programmable Peripheral Interconnect (PPI) module.
 *
 * @details Channels 0, 1, and 2 are used for the BLE LED, DCC Output, and DCC Programming Output respectively. These channels are not used by the softdevice.
 * As the softdevice controls access to the PPI, this configuration is done through softdevice calls. 
 */
//static void ppi_init(void)
//{
//    uint32_t err_code;
//
//    // Configure PPI channel 0 to toggle GPIOTE OUT[1] (BLE LED) on every TIMER2 COMPARE[0] match
//    err_code = sd_ppi_channel_assign(0, &NRF_TIMER2->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[1]);
//    APP_ERROR_CHECK(err_code);
//
//    // Enable PPI channel 0
//    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH0_Enabled << PPI_CHEN_CH0_Pos);
//    APP_ERROR_CHECK(err_code);
//
//    // Configure PPI channel 1 to toggle GPIOTE OUT[2] (DCC Output) on every TIMER1 COMPARE[0] match
//    err_code = sd_ppi_channel_assign(1, &NRF_TIMER1->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[2]);
//    APP_ERROR_CHECK(err_code);
//
//    // Enable PPI channel 1
//    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH1_Enabled << PPI_CHEN_CH1_Pos);
//    APP_ERROR_CHECK(err_code);
//    
//    // Configure PPI channel 2 to toggle GPIOTE OUT[3] (DCC Programming Output) on every TIMER2 COMPARE[0] match
//    err_code = sd_ppi_channel_assign(2, &NRF_TIMER2->EVENTS_COMPARE[0], &NRF_GPIOTE->TASKS_OUT[3]);
//    APP_ERROR_CHECK(err_code);
//    
//    // Enable PPI channel 2
//    err_code = sd_ppi_channel_enable_set(PPI_CHEN_CH2_Enabled << PPI_CHEN_CH2_Pos);
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for initializing the LPCOMP module.
 */
//static void lpcomp_init(void)
//{
//    // Select P0.1 as the LPCOMP input (LPCOMP can be used concurrently with the ADC provided the input is the same, as only the PSEL MUX is shared, see https://devzone.nordicsemi.com/question/22244/can-i-really-not-use-lpcomp-and-adc-at-the-same-time/)
//    NRF_LPCOMP->PSEL = LPCOMP_PSEL_PSEL_AnalogInput2;
//    // Set reference to VDD * 7/8
//    // For sense R = 1.74k, the trip points are:
//
//    // +---------------+------------+------------+
//    // | Sensitivity   | VDD = 2.3V | VDD = 3.0V |
//    // +---------------+------------+------------+
//    // | 300uA/A (min) |    3.86A   |    5.03A   |
//    // +---------------+------------+------------+
//    // | 377uA/A (nom) |    3.07A   |    4.00A   |
//    // +---------------+------------+------------+
//    // | 450uA/A (max) |    2.57A   |    3.35A   |
//    // +---------------+------------+------------+
//    
//    NRF_LPCOMP->REFSEL = LPCOMP_REFSEL_REFSEL_SupplySevenEighthsPrescaling;
//    // Allow READY and UP event to trigger an interrupt
//    NRF_LPCOMP->INTENSET = (LPCOMP_INTENSET_UP_Msk | LPCOMP_INTENSET_READY_Msk);
//    // Finally, turn on the comparator
//    NRF_LPCOMP->ENABLE = LPCOMP_ENABLE_ENABLE_Enabled;
//
//    // Register LPCOMP interrupt with softdevice
//    NVIC_SetPriority(LPCOMP_IRQn, LPCOMP_IRQ_PRI);
//    NVIC_ClearPendingIRQ(LPCOMP_IRQn);
//    NVIC_EnableIRQ(LPCOMP_IRQn);
//
//    // Start up the comparator
//    NRF_LPCOMP->TASKS_START = 1;
//}


