tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
    // Make everything little endian
    identifier[0] = firmware_version & 0xFF;
    identifier[1] = (firmware_version >> 8) & 0xFF;
    identifier[2] = (firmware_version >> 16) & 0xFF;
    identifier[3] = (firmware_version >> 24) & 0xFF;
    identifier[4] = deviceID[0] & 0xFF;
    identifier[5] = (deviceID[0] >> 8) & 0xFF;
    identifier[6] = (deviceID[0] >> 16) & 0xFF;
    identifier[7] = (deviceID[0] >> 24) & 0xFF;
    identifier[8] = deviceID[1] & 0xFF;
    identifier[9] = (deviceID[1] >> 8) & 0xFF;
    identifier[10] = (deviceID[1] >> 16) & 0xFF;
    identifier[11] = (deviceID[1] >> 24) & 0xFF;

    manuf_data.data.p_data = identifier;
    manuf_data.data.size = sizeof(identifier);

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE; // Set this as we advertise for an unlimited time
    advdata.p_manuf_specific_data   = &manuf_data;
    
    // Build and set scan response data
    memset(&srdata, 0, sizeof(srdata));
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    srdata.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data, &m_adv_data.scan_rsp_data.len);
    APP_ERROR_CHECK(err_code);

    // Set advertising parameters.
    memset(&adv_params, 0, sizeof(adv_params));
    adv_params.primary_phy     = BLE_GAP_PHY_1MBPS;
    adv_params.duration        = APP_ADV_DURATION;
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr     = NULL;
    adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    adv_params.interval        = APP_ADV_INTERVAL;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t           err_code;
    ble_bluetrack_init_t init;
    nrf_ble_qwr_init_t   qwr_init = {0};

    // Initialise Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Intitialise BlueTrack write handlers
    init.address_write_handler = address_write_handler;
    init.dcc_command_write_handler = dcc_command_write_handler;
    init.programming_track_select_write_handler = programming_track_select_write_handler;
    init.stop_write_handler = stop_write_handler;
    init.service_command_write_handler = service_command_write_handler;

    err_code = ble_bluetrack_init(&m_bluetrack, &init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing security parameters.
 */
//static void sec_params_init(void)
//{
//    m_sec_params.timeout      = SEC_PARAM_TIMEOUT;
//    m_sec_params.bond         = SEC_PARAM_BOND;
//    m_sec_params.mitm         = SEC_PARAM_MITM;
//    m_sec_params.io_caps      = SEC_PARAM_IO_CAPABILITIES;
//    m_sec_params.oob          = SEC_PARAM_OOB;
//    m_sec_params.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
//    m_sec_params.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
//}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    ret_code_t               err_code;
    ble_conn_params_init_t   cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t             err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t                       err_code;
    ble_gatts_evt_write_t const * p_evt_write;
    uint8_t const * data;
//    static ble_gap_evt_auth_status_t m_auth_status;
//    ble_gap_enc_info_t *             p_enc_info;
//    uint16_t                         m_programming_track_select_len = PROGRAMMING_TRACK_SELECT_CHAR_SIZE;
//    uint8_t                          m_programming_track_select_value = 0x00;
//    uint16_t                         m_stop_len = STOP_CHAR_SIZE;
//    uint8_t                          m_stop_value = 0x01;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            NRF_LOG_INFO("Connected");
//            // Remove LED from GPIOTE control
//            NRF_GPIOTE->CONFIG[1] &= ~GPIOTE_CONFIG_MODE_Msk;
//            NRF_GPIOTE->CONFIG[1] |= GPIOTE_CONFIG_MODE_Disabled << GPIOTE_CONFIG_MODE_Pos;
//            
//            // Reconfigure TIMER2 for DCC output
//            NRF_TIMER2->TASKS_STOP = 1;
//            NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_DCC;
//            NRF_TIMER2->CC[0] = DCC_ONE_CC_VAL;
//            NRF_TIMER2->TASKS_START = 1;
//            
//            // Set LED
//            nrf_gpio_pin_set(BLE_LED_PIN_NO);

