tomcatty/BluetrackHub/nRF5SDK160098a08e2/examples/ble_peripheral/ble_app_bluetrack/main.c
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            NRF_LOG_INFO("Disconnected");
//            // Reconfigure TIMER2 for LED output
//            NRF_TIMER2->TASKS_STOP = 1;
//            NRF_TIMER2->PRESCALER = TIMER2_PRESCALER_VAL_LED;
//            NRF_TIMER2->CC[0] = TIMER2_CC_VAL_LED;
//            NRF_TIMER2->TASKS_START = 1;
//            
//            // Restore LED to GPIOTE control
//            NRF_GPIOTE->CONFIG[1] &= ~GPIOTE_CONFIG_MODE_Msk;
//            NRF_GPIOTE->CONFIG[1] |= GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos;
//            
            m_conn_handle = BLE_CONN_HANDLE_INVALID;

//            // Remove all pending periodic speed commands
//            remove_all_speed_commands();
            
//            // Reset programming track selection and characteristic
//            programming_track_mode = MAIN;
//            err_code = sd_ble_gatts_value_set(m_bluetrack.programming_track_select_char_handles.value_handle, 0, &m_programming_track_select_len, &m_programming_track_select_value);
//            APP_ERROR_CHECK(err_code);

//            // Reset stop selection and characteristic
//            nrf_gpio_pin_clear(BRAKE_PIN_NO);
//            nrf_gpio_pin_set(STOP_LED_PIN_NO);
//            err_code = sd_ble_gatts_value_set(m_bluetrack.stop_char_handles.value_handle, 0, &m_stop_len, &m_stop_value);
//            APP_ERROR_CHECK(err_code);

            // Restart advertising
            advertising_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Pairing not supported
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP,
                                                   NULL,
                                                   NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            // No system attributes have been stored.
            err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_WRITE:

            p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
            data = p_evt_write->data;
            // Empirically, Service Changed CCCD has handle 0xD, and is always Indicated (value is 0x2)
            // Note data is little endian
            if((p_evt_write->handle == 0xD) && (p_evt_write->len == 2) && (data[0] == 0x2)) {
                NRF_LOG_INFO("Service Changed ready to Indicate");
                err_code = gscm_service_changed_ind_send(m_conn_handle);
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for initializing the log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for the Power manager.
 */
//static void power_manage(void)
//{
//    uint32_t err_code = sd_app_evt_wait();
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize
//    gio_init();
//    gpiote_init();
    timers_init();
    log_init();
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
//    sec_params_init();
//    ppi_init();
//    lpcomp_init();
//    adc_init();
//    bluetrack_init();

    // Start execution
    NRF_LOG_INFO("Bluetrack started.");
//    timers_start();
    advertising_start();

    // Enter main loop
    for (;;)
    {
        app_sched_execute();
        idle_state_handle();
    }
}

/**
 * @}
 */
